apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_usb.h
/* Register addresses ***************************************************************/
/* USB Host Controller (OHCI) *******************************************************/
/* Control and status registers (section 7.1) */

#define LPC17_40_USBHOST_HCIREV             (LPC17_40_USB_BASE+OHCI_HCIREV_OFFSET)
#define LPC17_40_USBHOST_CTRL               (LPC17_40_USB_BASE+OHCI_CTRL_OFFSET)
#define LPC17_40_USBHOST_CMDST              (LPC17_40_USB_BASE+OHCI_CMDST_OFFSET)
#define LPC17_40_USBHOST_INTST              (LPC17_40_USB_BASE+OHCI_INTST_OFFSET)
#define LPC17_40_USBHOST_INTEN              (LPC17_40_USB_BASE+OHCI_INTEN_OFFSET)
#define LPC17_40_USBHOST_INTDIS             (LPC17_40_USB_BASE+OHCI_INTDIS_OFFSET)

/* Memory pointers (section 7.2) */

#define LPC17_40_USBHOST_HCCA               (LPC17_40_USB_BASE+OHCI_HCCA_OFFSET)
#define LPC17_40_USBHOST_PERED              (LPC17_40_USB_BASE+OHCI_PERED_OFFSET)
#define LPC17_40_USBHOST_CTRLHEADED         (LPC17_40_USB_BASE+OHCI_CTRLHEADED_OFFSET)
#define LPC17_40_USBHOST_CTRLED             (LPC17_40_USB_BASE+OHCI_CTRLED_OFFSET)
#define LPC17_40_USBHOST_BULKHEADED         (LPC17_40_USB_BASE+OHCI_BULKHEADED_OFFSET)
#define LPC17_40_USBHOST_BULKED             (LPC17_40_USB_BASE+OHCI_BULKED_OFFSET)
#define LPC17_40_USBHOST_DONEHEAD           (LPC17_40_USB_BASE+OHCI_DONEHEAD_OFFSET)

/* Frame counters (section 7.3) */

#define LPC17_40_USBHOST_FMINT              (LPC17_40_USB_BASE+OHCI_FMINT_OFFSET)
#define LPC17_40_USBHOST_FMREM              (LPC17_40_USB_BASE+OHCI_FMREM_OFFSET)
#define LPC17_40_USBHOST_FMNO               (LPC17_40_USB_BASE+OHCI_FMNO_OFFSET)
#define LPC17_40_USBHOST_PERSTART           (LPC17_40_USB_BASE+OHCI_PERSTART_OFFSET)

/* Root hub ports (section 7.4) */

#define LPC17_40_USBHOST_LSTHRES            (LPC17_40_USB_BASE+OHCI_LSTHRES_OFFSET)
#define LPC17_40_USBHOST_RHDESCA            (LPC17_40_USB_BASE+OHCI_RHDESCA_OFFSET)
#define LPC17_40_USBHOST_RHDESCB            (LPC17_40_USB_BASE+OHCI_RHDESCB_OFFSET)
#define LPC17_40_USBHOST_RHSTATUS           (LPC17_40_USB_BASE+OHCI_RHSTATUS_OFFSET)
#define LPC17_40_USBHOST_RHPORTST1          (LPC17_40_USB_BASE+OHCI_RHPORTST1_OFFSET)
#define LPC17_40_USBHOST_RHPORTST2          (LPC17_40_USB_BASE+OHCI_RHPORTST2_OFFSET)
#define LPC17_40_USBHOST_MODID              (LPC17_40_USB_BASE+LPC17_40_USBHOST_MODID_OFFSET)

/* USB OTG Controller ***************************************************************/
/* OTG registers */

#define LPC17_40_USBOTG_INTST               (LPC17_40_USB_BASE+LPC17_40_USBOTG_INTST_OFFSET)
#define LPC17_40_USBOTG_INTEN               (LPC17_40_USB_BASE+LPC17_40_USBOTG_INTEN_OFFSET)
#define LPC17_40_USBOTG_INTSET              (LPC17_40_USB_BASE+LPC17_40_USBOTG_INTSET_OFFSET)
#define LPC17_40_USBOTG_INTCLR              (LPC17_40_USB_BASE+LPC17_40_USBOTG_INTCLR_OFFSET)
#define LPC17_40_USBOTG_STCTRL              (LPC17_40_USB_BASE+LPC17_40_USBOTG_STCTRL_OFFSET)
#define LPC17_40_USBOTG_TMR                 (LPC17_40_USB_BASE+LPC17_40_USBOTG_TMR_OFFSET)

/* USB Device Controller ************************************************************/
/* Device interrupt registers.  See also SYSCON_USBINTST in lpc17_40_syscon.h */

#define LPC17_40_USBDEV_INTST               (LPC17_40_USB_BASE+LPC17_40_USBDEV_INTST_OFFSET)
#define LPC17_40_USBDEV_INTEN               (LPC17_40_USB_BASE+LPC17_40_USBDEV_INTEN_OFFSET)
#define LPC17_40_USBDEV_INTCLR              (LPC17_40_USB_BASE+LPC17_40_USBDEV_INTCLR_OFFSET)
#define LPC17_40_USBDEV_INTSET              (LPC17_40_USB_BASE+LPC17_40_USBDEV_INTSET_OFFSET)

/* SIE Command registers */

#define LPC17_40_USBDEV_CMDCODE             (LPC17_40_USB_BASE+LPC17_40_USBDEV_CMDCODE_OFFSET)
#define LPC17_40_USBDEV_CMDDATA             (LPC17_40_USB_BASE+LPC17_40_USBDEV_CMDDATA_OFFSET)

/* USB transfer registers */

#define LPC17_40_USBDEV_RXDATA              (LPC17_40_USB_BASE+LPC17_40_USBDEV_RXDATA_OFFSET)
#define LPC17_40_USBDEV_RXPLEN              (LPC17_40_USB_BASE+LPC17_40_USBDEV_RXPLEN_OFFSET)
#define LPC17_40_USBDEV_TXDATA              (LPC17_40_USB_BASE+LPC17_40_USBDEV_TXDATA_OFFSET)
#define LPC17_40_USBDEV_TXPLEN              (LPC17_40_USB_BASE+LPC17_40_USBDEV_TXPLEN_OFFSET)
#define LPC17_40_USBDEV_CTRL                (LPC17_40_USB_BASE+LPC17_40_USBDEV_CTRL_OFFSET)

/* More Device interrupt registers */

#define LPC17_40_USBDEV_INTPRI              (LPC17_40_USB_BASE+LPC17_40_USBDEV_INTPRI_OFFSET)

/* Endpoint interrupt registers */

#define LPC17_40_USBDEV_EPINTST             (LPC17_40_USB_BASE+LPC17_40_USBDEV_EPINTST_OFFSET)
#define LPC17_40_USBDEV_EPINTEN             (LPC17_40_USB_BASE+LPC17_40_USBDEV_EPINTEN_OFFSET)
#define LPC17_40_USBDEV_EPINTCLR            (LPC17_40_USB_BASE+LPC17_40_USBDEV_EPINTCLR_OFFSET)
#define LPC17_40_USBDEV_EPINTSET            (LPC17_40_USB_BASE+LPC17_40_USBDEV_EPINTSET_OFFSET)
#define LPC17_40_USBDEV_EPINTPRI            (LPC17_40_USB_BASE+LPC17_40_USBDEV_EPINTPRI_OFFSET)

/* Endpoint realization registers */

#define LPC17_40_USBDEV_REEP                (LPC17_40_USB_BASE+LPC17_40_USBDEV_REEP_OFFSET)
#define LPC17_40_USBDEV_EPIND               (LPC17_40_USB_BASE+LPC17_40_USBDEV_EPIND_OFFSET)
#define LPC17_40_USBDEV_MAXPSIZE            (LPC17_40_USB_BASE+LPC17_40_USBDEV_MAXPSIZE_OFFSET)

/* DMA registers */

#define LPC17_40_USBDEV_DMARST              (LPC17_40_USB_BASE+LPC17_40_USBDEV_DMARST_OFFSET)
#define LPC17_40_USBDEV_DMARCLR             (LPC17_40_USB_BASE+LPC17_40_USBDEV_DMARCLR_OFFSET)
#define LPC17_40_USBDEV_DMARSET             (LPC17_40_USB_BASE+LPC17_40_USBDEV_DMARSET_OFFSET)
#define LPC17_40_USBDEV_UDCAH               (LPC17_40_USB_BASE+LPC17_40_USBDEV_UDCAH_OFFSET)
#define LPC17_40_USBDEV_EPDMAST             (LPC17_40_USB_BASE+LPC17_40_USBDEV_EPDMAST_OFFSET)
#define LPC17_40_USBDEV_EPDMAEN             (LPC17_40_USB_BASE+LPC17_40_USBDEV_EPDMAEN_OFFSET)
#define LPC17_40_USBDEV_EPDMADIS            (LPC17_40_USB_BASE+LPC17_40_USBDEV_EPDMADIS_OFFSET)
#define LPC17_40_USBDEV_DMAINTST            (LPC17_40_USB_BASE+LPC17_40_USBDEV_DMAINTST_OFFSET)
#define LPC17_40_USBDEV_DMAINTEN            (LPC17_40_USB_BASE+LPC17_40_USBDEV_DMAINTEN_OFFSET)
#define LPC17_40_USBDEV_EOTINTST            (LPC17_40_USB_BASE+LPC17_40_USBDEV_EOTINTST_OFFSET)
#define LPC17_40_USBDEV_EOTINTCLR           (LPC17_40_USB_BASE+LPC17_40_USBDEV_EOTINTCLR_OFFSET)
#define LPC17_40_USBDEV_EOTINTSET           (LPC17_40_USB_BASE+LPC17_40_USBDEV_EOTINTSET_OFFSET)
#define LPC17_40_USBDEV_NDDRINTST           (LPC17_40_USB_BASE+LPC17_40_USBDEV_NDDRINTST_OFFSET)
#define LPC17_40_USBDEV_NDDRINTCLR          (LPC17_40_USB_BASE+LPC17_40_USBDEV_NDDRINTCLR_OFFSET)
#define LPC17_40_USBDEV_NDDRINTSET          (LPC17_40_USB_BASE+LPC17_40_USBDEV_NDDRINTSET_OFFSET)
#define LPC17_40_USBDEV_SYSERRINTST         (LPC17_40_USB_BASE+LPC17_40_USBDEV_SYSERRINTST_OFFSET)
#define LPC17_40_USBDEV_SYSERRINTCLR        (LPC17_40_USB_BASE+LPC17_40_USBDEV_SYSERRINTCLR_OFFSET)
#define LPC17_40_USBDEV_SYSERRINTSET        (LPC17_40_USB_BASE+LPC17_40_USBDEV_SYSERRINTSET_OFFSET)

/* OTG I2C registers ****************************************************************/

#define LPC17_40_OTGI2C_RX                  (LPC17_40_USB_BASE+LPC17_40_OTGI2C_RX_OFFSET)
#define LPC17_40_OTGI2C_TX                  (LPC17_40_USB_BASE+LPC17_40_OTGI2C_TX_OFFSET)
#define LPC17_40_OTGI2C_STS                 (LPC17_40_USB_BASE+LPC17_40_OTGI2C_STS_OFFSET)
#define LPC17_40_OTGI2C_CTL                 (LPC17_40_USB_BASE+LPC17_40_OTGI2C_CTL_OFFSET)
#define LPC17_40_OTGI2C_CLKHI               (LPC17_40_USB_BASE+LPC17_40_OTGI2C_CLKHI_OFFSET)
#define LPC17_40_OTGI2C_CLKLO               (LPC17_40_USB_BASE+LPC17_40_OTGI2C_CLKLO_OFFSET)

/* Clock control registers ***********************************************************/

#define LPC17_40_USBOTG_CLKCTRL             (LPC17_40_USB_BASE+LPC17_40_USBOTG_CLKCTRL_OFFSET)
#define LPC17_40_USBOTG_CLKST               (LPC17_40_USB_BASE+LPC17_40_USBOTG_CLKST_OFFSET)

#define LPC17_40_USBDEV_CLKCTRL             (LPC17_40_USB_BASE+LPC17_40_USBDEV_CLKCTRL_OFFSET)
#define LPC17_40_USBDEV_CLKST               (LPC17_40_USB_BASE+LPC17_40_USBDEV_CLKST_OFFSET)

/* Register bit definitions *********************************************************/
/* USB Host Controller (OHCI) *******************************************************/
/* See include/nuttx/usb/ohci.h */

/* Module ID/Revision ID */

#define USBHOST_MODID_VER_SHIFT             (0)      /* Bits 0-7: Unique version number */
#define USBHOST_MODID_VER_MASK              (0xff << USBHOST_MODID_VER_SHIFT)
#define USBHOST_MODID_REV_SHIFT             (8)      /* Bits 9-15: Unique revision number */
#define USBHOST_MODID_REV_MASK              (0xff << USBHOST_MODID_REV_SHIFT)
#define USBHOST_MODID_3505_SHIFT            (16)     /* Bits 16-31: 0x3505 */
#define USBHOST_MODID_3505_MASK             (0xffff << USBHOST_MODID_3505_SHIFT)
#  define USBHOST_MODID_3505                (0x3505 << USBHOST_MODID_3505_SHIFT)

/* USB OTG Controller ***************************************************************/
/* OTG registers:
 *
 * OTG Interrupt Status, OTG Interrupt Enable, OTG Interrupt Set, AND OTG Interrupt
 * Clear
 */

#define USBOTG_INT_TMR                      (1 << 0)  /* Bit 0:  Timer time-out */
#define USBOTG_INT_REMOVE_PU                (1 << 1)  /* Bit 1:  Remove pull-up */
#define USBOTG_INT_HNP_FAILURE              (1 << 2)  /* Bit 2:  HNP failed */
#define USBOTG_INT_HNP_SUCCESS              (1 << 3)  /* Bit 3:  HNP succeeded */
                                                      /* Bits 4-31: Reserved */
/* OTG Status and Control */

