apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_usb.h
#define USBOTG_STCTRL_PORTFUNC_SHIFT        (0)       /* Bits 0-1: Controls port function */
#define USBOTG_STCTRL_PORTFUNC_MASK         (3 << USBOTG_STCTRL_PORTFUNC_SHIFT)
#  define USBOTG_STCTRL_PORTFUNC_HNPOK      (1 << USBOTG_STCTRL_PORTFUNC_SHIFT) /* HNP succeeded */
#define USBOTG_STCTRL_TMRSCALE_SHIFT        (2)       /* Bits 2-3: Timer scale selection */
#define USBOTG_STCTRL_TMRSCALE_MASK         (3 << USBOTG_STCTRL_TMR_SCALE_SHIFT)
#  define USBOTG_STCTRL_TMRSCALE_10US       (0 << USBOTG_STCTRL_TMR_SCALE_SHIFT) /* 10uS (100 KHz) */
#  define USBOTG_STCTRL_TMRSCALE_100US      (1 << USBOTG_STCTRL_TMR_SCALE_SHIFT) /* 100uS (10 KHz) */
#  define USBOTG_STCTRL_TMRSCALE_1000US     (2 << USBOTG_STCTRL_TMR_SCALE_SHIFT) /* 1000uS (1 KHz) */
#define USBOTG_STCTRL_TMRMODE               (1 << 4)  /* Bit 4:  Timer mode selection */
#define USBOTG_STCTRL_TMREN                 (1 << 5)  /* Bit 5:  Timer enable */
#define USBOTG_STCTRL_TMRRST                (1 << 6)  /* Bit 6:  TTimer reset */
                                                      /* Bit 7:  Reserved */
#define USBOTG_STCTRL_BHNPTRACK             (1 << 8)  /* Bit 8:  Enable HNP tracking for B-device (peripheral) */
#define USBOTG_STCTRL_AHNPTRACK             (1 << 9)  /* Bit 9:  Enable HNP tracking for A-device (host) */
#define USBOTG_STCTRL_PUREMOVED             (1 << 10) /* Bit 10: Set when D+ pull-up removed */
                                                      /* Bits 11-15: Reserved */
#define USBOTG_STCTRL_TMRCNT_SHIFT          (0)       /* Bits 16-313: Timer scale selection */
#define USBOTG_STCTRL_TMRCNT_MASK           (0ffff << USBOTG_STCTRL_TMR_CNT_SHIFT)

/* OTG Timer */

#define USBOTG_TMR_TIMEOUTCNT_SHIFT         (0)       /* Bits 0-15: Interrupt when CNT matches this */
#define USBOTG_TMR_TIMEOUTCNT_MASK          (0xffff << USBOTG_TMR_TIMEOUTCNT_SHIFT)
                                                      /* Bits 16-31: Reserved */

/* USB Device Controller ************************************************************/
/* Device interrupt registers.  See also SYSCON_USBINTST in lpc17_40_syscon.h */
/* USB Device Interrupt Status, USB Device Interrupt Enable, USB Device Interrupt
 * Clear, USB Device Interrupt Set, and USB Device Interrupt Priority
 */

#define USBDEV_INT_FRAME                    (1 << 0)  /* Bit 0:  frame interrupt (every 1 ms) */
#define USBDEV_INT_EPFAST                   (1 << 1)  /* Bit 1:  Fast endpoint interrupt */
#define USBDEV_INT_EPSLOW                   (1 << 2)  /* Bit 2:  Slow endpoints interrupt */
#define USBDEV_INT_DEVSTAT                  (1 << 3)  /* Bit 3:  Bus reset, suspend change or connect change */
#define USBDEV_INT_CCEMPTY                  (1 << 4)  /* Bit 4:  Command code register empty */
#define USBDEV_INT_CDFULL                   (1 << 5)  /* Bit 5:  Command data register full */
#define USBDEV_INT_RXENDPKT                 (1 << 6)  /* Bit 6:  RX endpoint data transferred */
#define USBDEV_INT_TXENDPKT                 (1 << 7)  /* Bit 7:  TX endpoint data tansferred */
#define USBDEV_INT_EPRLZED                  (1 << 8)  /* Bit 8:  Endpoints realized */
#define USBDEV_INT_ERRINT                   (1 << 9)  /* Bit 9:  Error Interrupt */
                                                      /* Bits 10-31: Reserved */
/* SIE Command registers:
 *
 * USB Command Code
 */
                                                      /* Bits 0-7: Reserved */
#define USBDEV_CMDCODE_PHASE_SHIFT          (8)       /* Bits 8-15: Command phase */
#define USBDEV_CMDCODE_PHASE_MASK           (0xff << USBDEV_CMDCODE_PHASE_SHIFT)
#  define USBDEV_CMDCODE_PHASE_READ         (1 << USBDEV_CMDCODE_PHASE_SHIFT)
#  define USBDEV_CMDCODE_PHASE_WRITE        (2 << USBDEV_CMDCODE_PHASE_SHIFT)
#  define USBDEV_CMDCODE_PHASE_COMMAND      (5 << USBDEV_CMDCODE_PHASE_SHIFT)
#define USBDEV_CMDCODE_CMD_SHIFT            (16)     /* Bits 15-23: Command (READ/COMMAND phases) */
#define USBDEV_CMDCODE_CMD_MASK             (0xff << USBDEV_CMDCODE_CMD_SHIFT)
#define USBDEV_CMDCODE_WDATA_SHIFT          (16)     /* Bits 15-23: Write dagta (WRITE phase) */
#define USBDEV_CMDCODE_WDATA_MASK           (0xff << USBDEV_CMDCODE_CMD_SHIFT)
                                                      /* Bits 24-31: Reserved */
/* USB Command Data */

#define USBDEV_CMDDATA_SHIFT                (0)       /* Bits 0-7: Command read data */
#define USBDEV_CMDDATA_MASK                 (0xff << USBDEV_CMDDATA_SHIFT)
                                                      /* Bits 8-31: Reserved */
/* USB transfer registers:
 *
 * USB Receive Data (Bits 0-31: Received data)
 */

/* USB Receive Packet Length */

#define USBDEV_RXPLEN_SHIFT                 (0)       /* Bits 0-9: Bytes remaining to be read */
#define USBDEV_RXPLEN_MASK                  (0x3ff << USBDEV_RXPLEN_SHIFT)
#define USBDEV_RXPLEN_DV                    (1 << 10) /* Bit 10: DV Data valid */
#define USBDEV_RXPLEN_PKTRDY                (1 << 11) /* Bit 11: Packet ready for reading */
                                                      /* Bits 12-31: Reserved */
/* USB Transmit Data (Bits 0-31: Transmit data) */

/* USB Transmit Packet Length */

#define USBDEV_TXPLEN_SHIFT                 (0)       /* Bits 0-9: Bytes remaining to be written */
#define USBDEV_TXPLEN_MASK                  (0x3ff << USBDEV_TXPLEN_SHIFT)
                                                      /* Bits 10-31: Reserved */
/* USB Control */

#define USBDEV_CTRL_RDEN                    (1 << 0)  /* Bit 0:  Read mode control */
#define USBDEV_CTRL_WREN                    (1 << 1)  /* Bit 1:  Write mode control */
#define USBDEV_CTRL_LOGEP_SHIFT             (2)       /* Bits 2-5: Logical Endpoint number */
#define USBDEV_CTRL_LOGEP_MASK              (15 << USBDEV_CTRL_LOGEP_SHIFT)
                                                      /* Bits 6-31: Reserved */
/* Endpoint interrupt registers:
 *
 * USB Endpoint Interrupt Status, USB Endpoint Interrupt Enable, USB Endpoint Interrupt
 * Clear, USB Endpoint Interrupt Set, and USB Endpoint Priority.  Bits correspond
 * to on RX or TX value for any of 15 logical endpoints).
 */

#define USBDEV_LOGEPRX(n)                   (1 << ((n) << 1))
#define USBDEV_LOGEPTX(n)                   ((1 << ((n) << 1)) + 1)
#define USBDEV_LOGEPRX0                     (1 << 0)
#define USBDEV_LOGEPTX0                     (1 << 1)
#define USBDEV_LOGEPRX1                     (1 << 2)
#define USBDEV_LOGEPTX1                     (1 << 3)
#define USBDEV_LOGEPRX2                     (1 << 4)
#define USBDEV_LOGEPTX2                     (1 << 5)
#define USBDEV_LOGEPRX3                     (1 << 6)
#define USBDEV_LOGEPTX3                     (1 << 7)
#define USBDEV_LOGEPRX4                     (1 << 8)
#define USBDEV_LOGEPTX4                     (1 << 9)
#define USBDEV_LOGEPRX5                     (1 << 10)
#define USBDEV_LOGEPTX5                     (1 << 11)
#define USBDEV_LOGEPRX6                     (1 << 12)
#define USBDEV_LOGEPTX6                     (1 << 13)
#define USBDEV_LOGEPRX7                     (1 << 14)
#define USBDEV_LOGEPTX7                     (1 << 15)
#define USBDEV_LOGEPRX8                     (1 << 16)
#define USBDEV_LOGEPTX8                     (1 << 17)
#define USBDEV_LOGEPRX9                     (1 << 18)
#define USBDEV_LOGEPTX9                     (1 << 19)
#define USBDEV_LOGEPRX10                    (1 << 20)
#define USBDEV_LOGEPTX10                    (1 << 21)
#define USBDEV_LOGEPRX11                    (1 << 22)
#define USBDEV_LOGEPTX11                    (1 << 23)
#define USBDEV_LOGEPRX12                    (1 << 24)
#define USBDEV_LOGEPTX12                    (1 << 25)
#define USBDEV_LOGEPRX13                    (1 << 26)
#define USBDEV_LOGEPTX13                    (1 << 27)
#define USBDEV_LOGEPRX14                    (1 << 28)
#define USBDEV_LOGEPTX14                    (1 << 29)
#define USBDEV_LOGEPRX15                    (1 << 30)
#define USBDEV_LOGEPTX15                    (1 << 31)

