apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_usb.h
/* Endpoint realization registers:
 *
 * USB Realize Endpoint (Bits correspond to 1 of 32 physical endpoints)
 */

#define USBDEV_PHYEP(n)                     (1 << (n))
#define USBDEV_PHYEP0                       (1 << 0)
#define USBDEV_PHYEP1                       (1 << 1)
#define USBDEV_PHYEP2                       (1 << 2)
#define USBDEV_PHYEP3                       (1 << 3)
#define USBDEV_PHYEP4                       (1 << 4)
#define USBDEV_PHYEP5                       (1 << 5)
#define USBDEV_PHYEP6                       (1 << 6)
#define USBDEV_PHYEP7                       (1 << 7)
#define USBDEV_PHYEP8                       (1 << 8)
#define USBDEV_PHYEP9                       (1 << 9)
#define USBDEV_PHYEP10                      (1 << 10)
#define USBDEV_PHYEP11                      (1 << 11)
#define USBDEV_PHYEP12                      (1 << 12)
#define USBDEV_PHYEP13                      (1 << 13)
#define USBDEV_PHYEP14                      (1 << 14)
#define USBDEV_PHYEP15                      (1 << 15)
#define USBDEV_PHYEP16                      (1 << 16)
#define USBDEV_PHYEP17                      (1 << 17)
#define USBDEV_PHYEP18                      (1 << 18)
#define USBDEV_PHYEP19                      (1 << 19)
#define USBDEV_PHYEP20                      (1 << 20)
#define USBDEV_PHYEP21                      (1 << 21)
#define USBDEV_PHYEP22                      (1 << 22)
#define USBDEV_PHYEP23                      (1 << 23)
#define USBDEV_PHYEP24                      (1 << 24)
#define USBDEV_PHYEP25                      (1 << 25)
#define USBDEV_PHYEP26                      (1 << 26)
#define USBDEV_PHYEP27                      (1 << 27)
#define USBDEV_PHYEP28                      (1 << 28)
#define USBDEV_PHYEP29                      (1 << 29)
#define USBDEV_PHYEP30                      (1 << 30)
#define USBDEV_PHYEP31                      (1 << 31)

/* USB Endpoint Index */

#define USBDEV_EPIND_SHIFT                  (0)       /* Bits 0-4: Physical endpoint number (0-31) */
#define USBDEV_EPIND_MASK                   (31 << USBDEV_EPIND_SHIFT)
                                                      /* Bits 5-31: Reserved */
/* USB MaxPacketSize */

#define USBDEV_MAXPSIZE_SHIFT               (0)       /* Bits 0-9: Maximum packet size value */
#define USBDEV_MAXPSIZE_MASK                (0x3ff << USBDEV_MAXPSIZE_SHIFT)
                                                      /* Bits 10-31: Reserved */
/* DMA registers:
 *
 * USB DMA Request Status, USB DMA Request Clear, and USB DMA Request Set.  Registers
 * contain bits for each of 32 physical endpoints.  Use the USBDEV_PHYEP* definitions
 * above.  PHYEP0-1 (bits 0-1) must be zero.
 */

/* USB UDCA Head */
                                                     /* Bits 0-6: Reserved */
#define USBDEV_UDCAH_SHIFT                  (7)      /* Bits 7-31: UDCA start address */
#define USBDEV_UDCAH_MASK                   (0x01ffffff << USBDEV_UDCAH_SHIFT)

/* USB Endpoint DMA Status, USB Endpoint DMA Enable, and USB Endpoint DMA Disable.
 * Registers contain bits for physical endpoints 2-31. Use the USBDEV_PHYEP*
 * definitions above.  PHYEP0-1 (bits 0-1) must be zero.
 */

/* USB DMA Interrupt Status and USB DMA Interrupt Enable */

#define USBDEV_DMAINT_EOT                   (1 << 0)  /* Bit 0:  End of Transfer Interrupt */
#define USBDEV_DMAINT_NDDR                  (1 << 1)  /* Bit 1:  New DD Request Interrupt */
#define USBDEV_DMAINT_ERR                   (1 << 2)  /* Bit 2:  System Error Interrupt */
                                                      /* Bits 3-31: Reserved */
/* USB End of Transfer Interrupt Status, USB End of Transfer Interrupt Clear, and USB
 * End of Transfer Interrupt Set.  Registers contain bits for physical endpoints 2-31.
 * Use the USBDEV_PHYEP* definitions above.  PHYEP0-1 (bits 0-1) must be zero.
 */

/* USB New DD Request Interrupt Status, USB New DD Request Interrupt Clear, and USB
 * New DD Request Interrupt Set.  Registers contain bits for physical endpoints 2-31.
 * Use the USBDEV_PHYEP* definitions above.  PHYEP0-1 (bits 0-1) must be zero.
 */

/* USB System Error Interrupt Status, USB System Error Interrupt Clear, USB System
 * Error Interrupt Set.  Registers contain bits for  physical endpoints 2-31.  Use
 * the USBDEV_PHYEP* definitions above.  PHYEP0-1 (bits 0-1) must be zero.
 */

/* OTG I2C registers ****************************************************************/

/* I2C Receive */

#define OTGI2C_RX_DATA_SHIFT                (0)       /* Bits 0-7: RX data */
#define OTGI2C_RX_DATA_MASK                 (0xff << OTGI2C_RX_SHIFT)
                                                      /* Bits 8-31: Reserved */
/* I2C Transmit */

#define OTGI2C_TX_DATA_SHIFT                (0)       /* Bits 0-7: TX data */
#define OTGI2C_TX_DATA_MASK                 (0xff << OTGI2C_TX_DATA_SHIFT)
#define OTGI2C_TX_DATA_START                (1 << 8)  /* Bit 8:  Issue START before transmit */
#define OTGI2C_TX_DATA_STOP                 (1 << 9)  /* Bit 9:  Issue STOP before transmit */
                                                      /* Bits 3-31: Reserved */
/* I2C Status */

#define OTGI2C_STS_TDI                      (1 << 0)  /* Bit 0:  Transaction Done Interrupt */
#define OTGI2C_STS_AFI                      (1 << 1)  /* Bit 1:  Arbitration Failure Interrupt */
#define OTGI2C_STS_NAI                      (1 << 2)  /* Bit 2:  No Acknowledge Interrupt */
#define OTGI2C_STS_DRMI                     (1 << 3)  /* Bit 3:  Master Data Request Interrupt */
#define OTGI2C_STS_DRSI                     (1 << 4)  /* Bit 4:  Slave Data Request Interrupt */
#define OTGI2C_STS_ACTIVE                   (1 << 5)  /* Bit 5:  Indicates whether the bus is busy */
#define OTGI2C_STS_SCL                      (1 << 6)  /* Bit 6:  The current value of the SCL signal */
#define OTGI2C_STS_SDA                      (1 << 7)  /* Bit 7:  The current value of the SDA signal */
#define OTGI2C_STS_RFF                      (1 << 8)  /* Bit 8:  Receive FIFO Full (RFF) */
#define OTGI2C_STS_RFE                      (1 << 9)  /* Bit 9:  Receive FIFO Empty */
#define OTGI2C_STS_TFF                      (1 << 10) /* Bit 10: Transmit FIFO Full */
#define OTGI2C_STS_TFE                      (1 << 11) /* Bit 11: Transmit FIFO Empty */
                                                      /* Bits 12-31: Reserved */
/* I2C Control */

