apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_usb.h
#define OTGI2C_CTL_TDIE                     (1 << 0)  /* Bit 0:  Transmit Done Interrupt Enable */
#define OTGI2C_CTL_AFIE                     (1 << 1)  /* Bit 1:  Transmitter Arbitration Failure Interrupt Enable */
#define OTGI2C_CTL_NAIE                     (1 << 2)  /* Bit 2:  Transmitter No Acknowledge Interrupt Enable */
#define OTGI2C_CTL_DRMIE                    (1 << 3)  /* Bit 3:  Master Transmitter Data Request Interrupt Enable */
#define OTGI2C_CTL_DRSIE                    (1 << 4)  /* Bit 4:  Slave Transmitter Data Request Interrupt Enable */
#define OTGI2C_CTL_REFIE                    (1 << 5)  /* Bit 5:  Receive FIFO Full Interrupt Enable */
#define OTGI2C_CTL_RFDAIE                   (1 << 6)  /* Bit 6:  Receive Data Available Interrupt Enable */
#define OTGI2C_CTL_TFFIE                    (1 << 7)  /* Bit 7:  Transmit FIFO Not Full Interrupt Enable */
#define OTGI2C_CTL_SRST                     (1 << 8)  /* Bit 8:  Soft reset */
                                                      /* Bits 9-31: Reserved */
/* I2C Clock High */

#define OTGI2C_CLKHI_SHIFT                  (0)       /* Bits 0-7: Clock divisor high */
#define OTGI2C_CLKHI_MASK                   (0xff << OTGI2C_CLKHI_SHIFT)
                                                      /* Bits 8-31: Reserved */
/* I2C Clock Low */

#define OTGI2C_CLKLO_SHIFT                  (0)       /* Bits 0-7: Clock divisor high */
#define OTGI2C_CLLO_MASK                    (0xff << OTGI2C_CLKLO_SHIFT)
                                                      /* Bits 8-31: Reserved */
/* Clock control registers ***********************************************************/

/* USB Clock Control (OTG clock controller) and USB Clock Status (OTG clock status) */

#define USBDEV_CLK_HOSTCLK                  (1 << 0)  /* Bit 1:  Host clock (OTG only) */
#define USBDEV_CLK_DEVCLK                   (1 << 1)  /* Bit 1:  Device clock */
#define USBDEV_CLK_I2CCLK                   (1 << 2)  /* Bit 2:  I2C clock (OTG only) */
#define USBDEV_CLK_PORTSELCLK               (1 << 3)  /* Bit 3:  Port select register clock (device only) */
#define USBDEV_CLK_OTGCLK                   (1 << 3)  /* Bit 3:  OTG clock (OTG only) */
#define USBDEV_CLK_AHBCLK                   (1 << 4)  /* Bit 4:  AHB clock */
                                                      /* Bits 5-31: Reserved */
/* Alternate naming */

#define USBOTG_CLK_HOSTCLK                  USBDEV_CLK_HOSTCLK
#define USBOTG_CLK_DEVCLK                   USBDEV_CLK_DEVCLK
#define USBOTG_CLK_I2CCLK                   USBDEV_CLK_I2CCLK
#define USBOTG_CLK_PORTSELCLK               USBDEV_CLK_PORTSELCLK
#define USBOTG_CLK_OTGCLK                   USBDEV_CLK_OTGCLK
#define USBOTG_CLK_AHBCLK                   USBDEV_CLK_AHBCLK

/* Endpoints *************************************************************************/

#define LPC17_40_EP0_OUT                    0
#define LPC17_40_EP0_IN                     1
#define LPC17_40_CTRLEP_OUT                 LPC17_40_EP0_OUT
#define LPC17_40_CTRLEP_IN                  LPC17_40_EP0_IN
#define LPC17_40_EP1_OUT                    2
#define LPC17_40_EP1_IN                     3
#define LPC17_40_EP2_OUT                    4
#define LPC17_40_EP2_IN                     5
#define LPC17_40_EP3_OUT                    6
#define LPC17_40_EP3_IN                     7
#define LPC17_40_EP4_OUT                    8
#define LPC17_40_EP4_IN                     9
#define LPC17_40_EP5_OUT                    10
#define LPC17_40_EP5_IN                     11
#define LPC17_40_EP6_OUT                    12
#define LPC17_40_EP6_IN                     13
#define LPC17_40_EP7_OUT                    14
#define LPC17_40_EP7_IN                     15
#define LPC17_40_EP8_OUT                    16
#define LPC17_40_EP8_IN                     17
#define LPC17_40_EP9_OUT                    18
#define LPC17_40_EP9_IN                     19
#define LPC17_40_EP10_OUT                   20
#define LPC17_40_EP10_IN                    21
#define LPC17_40_EP11_OUT                   22
#define LPC17_40_EP11_IN                    23
#define LPC17_40_EP12_OUT                   24
#define LPC17_40_EP12_IN                    25
#define LPC17_40_EP13_OUT                   26
#define LPC17_40_EP13_IN                    27
#define LPC17_40_EP14_OUT                   28
#define LPC17_40_EP14_IN                    29
#define LPC17_40_EP15_OUT                   30
#define LPC17_40_EP15_IN                    31
#define LPC17_40_NUMEPS                     32

/* Commands *************************************************************************/

/* USB Command Code Register */

#define CMD_USBDEV_PHASESHIFT               (8)       /* Bits 8-15: Command phase value */
#define CMD_USBDEV_PHASEMASK                (0xff << CMD_USBDEV_PHASESHIFT)
#  define CMD_USBDEV_DATAWR                 (1 << CMD_USBDEV_PHASESHIFT)
#  define CMD_USBDEV_DATARD                 (2 << CMD_USBDEV_PHASESHIFT)
#  define CMD_USBDEV_CMDWR                  (5 << CMD_USBDEV_PHASESHIFT)
#define CMD_USBDEV_CMDSHIFT                 (16)      /* Bits 16-23: Device command/WDATA */
#define CMD_USBDEV_CMDMASK                  (0xff << CMD_USBDEV_CMDSHIFT)
#define CMD_USBDEV_WDATASHIFT               CMD_USBDEV_CMDSHIFT
#define CMD_USBDEV_WDATAMASK                CMD_USBDEV_CMDMASK

/* Device Commands */

#define CMD_USBDEV_SETADDRESS               (0x00d0)
#define CMD_USBDEV_CONFIG                   (0x00d8)
#define CMD_USBDEV_SETMODE                  (0x00f3)
#define CMD_USBDEV_READFRAMENO              (0x00f5)
#define CMD_USBDEV_READTESTREG              (0x00fd)
#define CMD_USBDEV_SETSTATUS                (0x01fe) /* Bit 8 set to distinguish get from set */
#define CMD_USBDEV_GETSTATUS                (0x00fe)
#define CMD_USBDEV_GETERRORCODE             (0x00ff)
#define CMD_USBDEV_READERRORSTATUS          (0x00fb)

/* Endpoint Commands */

#define CMD_USBDEV_EPSELECT                 (0x0000)
#define CMD_USBDEV_EPSELECTCLEAR            (0x0040)
#define CMD_USBDEV_EPSETSTATUS              (0x0140) /* Bit 8 set to distinguish get from selectclear */
#define CMD_USBDEV_EPCLRBUFFER              (0x00f2)
#define CMD_USBDEV_EPVALIDATEBUFFER         (0x00fa)

/* Command/response bit definitions ********************************************/
/* SETADDRESS (0xd0) command definitions */

