apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_usb.h
#define CMD_USBDEV_SETADDRESS_MASK          (0x7f)    /* Bits 0-6: Device address */
#define CMD_USBDEV_SETADDRESS_DEVEN         (1 << 7)  /* Bit 7:  Device enable */

/* SETSTATUS (0xfe) and GETSTATUS (0xfe) response: */

#define CMD_STATUS_CONNECT                  (1 << 0)  /* Bit 0:  Connected */
#define CMD_STATUS_CONNCHG                  (1 << 1)  /* Bit 1:  Connect change */
#define CMD_STATUS_SUSPEND                  (1 << 2)  /* Bit 2:  Suspend */
#define CMD_STATUS_SUSPCHG                  (1 << 3)  /* Bit 3:  Suspend change */
#define CMD_STATUS_RESET                    (1 << 4)  /* Bit 4:  Bus reset bit */

/* EPSELECT (0x00) endpoint status response */

#define CMD_EPSELECT_FE                     (1 << 0)  /* Bit 0:  IN empty or OUT full */
#define CMD_EPSELECT_ST                     (1 << 1)  /* Bit 1:  Endpoint is stalled */
#define CMD_EPSELECT_STP                    (1 << 2)  /* Bit 2:  Last packet was setup */
#define CMD_EPSELECT_PO                     (1 << 3)  /* Bit 3:  Previous packet was overwritten */
#define CMD_EPSELECT_EPN                    (1 << 4)  /* Bit 4:  NAK sent */
#define CMD_EPSELECT_B1FULL                 (1 << 5)  /* Bit 5:  Buffer 1 full */
#define CMD_EPSELECT_B2FULL                 (1 << 6)  /* Bit 6:  Buffer 2 full */
                                                      /* Bit 7:  Reserved */
/* EPSETSTATUS (0x40) command */

#define CMD_SETSTAUS_ST                     (1 << 0)  /* Bit 0:  Stalled endpoint bit */
                                                      /* Bits 1-4: Reserved */
#define CMD_SETSTAUS_DA                     (1 << 5)  /* Bit 5:  Disabled endpoint bit */
#define CMD_SETSTAUS_RFMO                   (1 << 6)  /* Bit 6:  Rate feedback mode */
#define CMD_SETSTAUS_CNDST                  (1 << 7)  /* Bit 7:  Conditional stall bit */

/* EPCLRBUFFER (0xf2) response */

#define CMD_USBDEV_CLRBUFFER_PO             (0x00000001)

/* SETMODE(0xf3) command */

#define CMD_SETMODE_APCLK                   (1 << 0)  /* Bit 0:  Always PLL Clock */
#define CMD_SETMODE_INAKCI                  (1 << 1)  /* Bit 1:  Interrupt on NAK for Control IN endpoint */
#define CMD_SETMODE_INAKCO                  (1 << 2)  /* Bit 2:  Interrupt on NAK for Control OUT endpoint */
#define CMD_SETMODE_INAKII                  (1 << 3)  /* Bit 3:  Interrupt on NAK for Interrupt IN endpoint */
#define CMD_SETMODE_INAKIO                  (1 << 4)  /* Bit 4:  Interrupt on NAK for Interrupt OUT endpoints */
#define CMD_SETMODE_INAKBI                  (1 << 5)  /* Bit 5:  Interrupt on NAK for Bulk IN endpoints */
#define CMD_SETMODE_INAKBO                  (1 << 6)  /* Bit 6:  Interrupt on NAK for Bulk OUT endpoints */

/* READERRORSTATUS (0xFb) command */

#define CMD_READERRORSTATUS_PIDERR          (1 << 0) /* Bit 0: PID encoding/unknown or Token CRC */
#define CMD_READERRORSTATUS_UEPKT           (1 << 1) /* Bit 1: Unexpected Packet */
#define CMD_READERRORSTATUS_DCRC            (1 << 2) /* Bit 2: Data CRC error */
#define CMD_READERRORSTATUS_TIMEOUT         (1 << 3) /* Bit 3: Time out error */
#define CMD_READERRORSTATUS_EOP             (1 << 4) /* Bit 4: End of packet error */
#define CMD_READERRORSTATUS_BOVRN           (1 << 5) /* Bit 5: Buffer Overrun */
#define CMD_READERRORSTATUS_BTSTF           (1 << 6) /* Bit 6: Bit stuff error */
#define CMD_READERRORSTATUS_TGLERR          (1 << 7) /* Bit 7: Wrong toggle in data PID */
#define CMD_READERRORSTATUS_ALLERRS         (0xff)

/* DMA ******************************************************************************/
/* The DMA descriptor */

#define USB_DMADESC_NEXTDDPTR               0 /* Offset 0: Next USB descriptor in RAM */
#define USB_DMADESC_CONFIG                  1 /* Offset 1: DMA configuration info. */
#define USB_DMADESC_STARTADDR               2 /* Offset 2: DMA start address */
#define USB_DMADESC_STATUS                  3 /* Offset 3: DMA status info (read only) */
#define USB_DMADESC_ISOCSIZEADDR            4 /* Offset 4: Isoc. packet size address */

/* Bit settings for CONFIG (offset 1 )*/

#define USB_DMADESC_MODE_SHIFT              (0)  /* Bits 0-1: DMA mode */
#define USB_DMADESC_MODE_MASK               (3 << USB_DMADESC_MODE_SHIFT)
#  define USB_DMADESC_MODENORMAL            (0 << USB_DMADESC_MODE_SHIFT) /* Mode normal */
#  define USB_DMADESC_MODEATLE              (1 << USB_DMADESC_MODE_SHIFT) /* ATLE normal */
#define USB_DMADESC_NEXTDDVALID             (1 << 2)  /* Bit 2:  Next descriptor valid */
                                                      /* Bit 3:  Reserved */
#define USB_DMADESC_ISCOEP                  (1 << 4)  /* Bit 4:  ISOC endpoint */
#define USB_DMADESC_PKTSIZE_SHIFT           (5)       /* Bits 5-15: Max packet size */
#define USB_DMADESC_PKTSIZE_MASK            (0x7ff << USB_DMADESC_PKTSIZE_SHIFT)
#define USB_DMADESC_BUFLEN_SHIFT            (16)      /* Bits 16-31: DMA buffer length */
#define USB_DMADESC_BUFLEN_MASK             (0xffff << USB_DMADESC_BUFLEN_SHIFT

/* Bit settings for STATUS (offset 3). All must be initialized to zero. */

#define USB_DMADESC_STATUS_SHIFT            (1)       /* Bits 1-4: DMA status */
#define USB_DMADESC_STATUS_MASK             (15 << USB_DMADESC_STATUS_SHIFT)
#  define USB_DMADESC_NOTSERVICED           (0 << USB_DMADESC_STATUS_SHIFT)
#  define USB_DMADESC_BEINGSERVICED         (1 << USB_DMADESC_STATUS_SHIFT)
#  define USB_DMADESC_NORMALCOMPLETION      (2 << USB_DMADESC_STATUS_SHIFT)
#  define USB_DMADESC_DATAUNDERRUN          (3 << USB_DMADESC_STATUS_SHIFT)
#  define USB_DMADESC_DATAOVERRUN           (8 << USB_DMADESC_STATUS_SHIFT)
#  define USB_DMADESC_SYSTEMERROR           (9 << USB_DMADESC_STATUS_SHIFT)
#define USB_DMADESC_PKTVALID                (1 << 5)  /* Bit 5:  Packet valid */
#define USB_DMADESC_LSBEXTRACTED            (1 << 6)  /* Bit 6: LS byte extracted */
#define USB_DMADESC_MSBEXTRACTED            (1 << 7)  /* Bit 7: MS byte extracted */
#define USB_DMADESC_MSGLENPOS_SHIFT         (8)       /* Bits 8-13: Message length position */
#define USB_DMADESC_MSGLENPOS_MASK          (0x3f << USB_DMADESC_MSGLENPOS_SHIFT)
#define USB_DMADESC_DMACOUNT_SHIFT          (16)      /* Bits 16-31:  DMA count */
#define USB_DMADESC_DMACOUNT_MASK           (0xffff << USB_DMADESC_DMACOUNT_SHIFT)

/* DMA packet size format */

#define USB_DMAPKTSIZE_PKTLEN_SHIFT         (0)       /* Bits 0-15: Packet length */
#define USB_DMAPKTSIZE_PKTLEN_MASK          (0xffff << USB_DMAPKTSIZE_PKTLEN_SHIFT)
#define USB_DMAPKTSIZE_PKTVALID             (1 << 16) /* Bit 16: Packet valid */
#define USB_DMAPKTSIZE_FRAMENO_SHIFT        (17)      /* Bit 17-31: Frame number */
#define USB_DMAPKTSIZE_FRAMENO_MASK         (0x7fff << USB_DMAPKTSIZE_FRAMENO_SHIFT)

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_USB_H */
